{
  "backend/main.mo": "Actor defines profile, matching, messaging, blocking, and payment method types and stores, with access‑controlled profile management and a discovery feed.",
  "feature_evidence.json": "Feature evidence report listing features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of major frontend source files.",
  "frontend/.ic-assets.json5": "ICP asset canister config enforcing serving from dist/, cache rules, CSP headers, and ignoring source files.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining production build requirements, build verification, and correct serving of dist/ artifacts.",
  "frontend/index.css": "Tailwind CSS base and theme tokens defining color system and light/dark mode variables.",
  "frontend/index.html": "Dev-time HTML entry with boot‑fallback UI and script loading via /src/main.tsx plus error/fallback logic.",
  "frontend/netlify.toml": "Netlify build and hosting config that builds, verifies dist/, applies SPA routing, and sets caching and security headers.",
  "frontend/scripts/verify-dist-index.mjs": "Node script verifying dist/index.html exists, avoids dev paths, and includes production asset references.",
  "frontend/src/App.tsx": "Sets up the main React app with routing, authentication checks, profile onboarding redirects, and global providers.",
  "frontend/src/components/AppLayout.tsx": "Provides the shared layout with header, main content area, and bottom navigation.",
  "frontend/src/components/Auth/AccessDenied.tsx": "Displays an access denied message for restricted admin pages with a button to return home.",
  "frontend/src/components/Auth/AccountMenu.tsx": "Renders the user account dropdown with profile info, navigation links, admin access, and logout handling.",
  "frontend/src/components/Auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and retry logic.",
  "frontend/src/components/Brand/AppLogo.tsx": "Displays the app’s heart icon and Spark brand text.",
  "frontend/src/components/Chat/MessageComposer.tsx": "Provides a text input and send button for composing and sending chat messages.",
  "frontend/src/components/Chat/MessageList.tsx": "Shows a scrollable list of chat messages and auto-scrolls to the newest message.",
  "frontend/src/components/Discover/DiscoverEmptyState.tsx": "Shows an empty state when no profiles remain and provides a refresh button.",
  "frontend/src/components/Discover/ProfileCard.tsx": "Displays a dating profile card with photo navigation, like/pass actions, and user blocking.",
  "frontend/src/components/Matches/MatchesEmptyState.tsx": "Shows an empty state for matches with a link to start discovering profiles.",
  "frontend/src/components/Navigation/BottomNav.tsx": "Renders the mobile bottom navigation bar with links to Discover, Matches, and Profile.",
  "frontend/src/components/Navigation/Header.tsx": "Displays the top header with the app logo and user account menu.",
  "frontend/src/components/Profile/PhotoPicker.tsx": "Renders a selectable grid of predefined avatar images and manages up to five selected photos via callbacks.",
  "frontend/src/components/Profile/ProfileForm.tsx": "Form for creating or editing a dating profile with validation, image selection, and submission to save the profile.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, discovery, likes, matches, and messages using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme color tokens and global styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity provider setup.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that checks admin status, displays the user's principal ID, and provides administrative UI sections.",
  "frontend/src/pages/AuthPage.tsx": "Landing page showing branding, feature highlights, and a login button for authentication.",
  "frontend/src/pages/ChatPage.tsx": "Displays a chat interface for a selected match, loading profile and messages and handling blocked state.",
  "frontend/src/pages/DiscoverPage.tsx": "Provides a swipe-style discovery feed where users can like or pass profiles and refresh the list.",
  "frontend/src/pages/MatchDetailPage.tsx": "Shows detailed profile information for a match with photo carousel, block/unblock actions, and navigation.",
  "frontend/src/pages/MatchesPage.tsx": "Placeholder matches list page currently showing an empty state until backend support is added.",
  "frontend/src/pages/PaymentMethodsPage.tsx": "Manages saved payment methods including add, edit, delete, and set default functionality with validation.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the current user's profile, supporting onboarding and standard profile updates.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for styling the frontend.",
  "frontend/vercel.json": "Defines Vercel deployment settings, including build command, SPA rewrites, and cache-control headers for HTML and assets.",
  "project_state.json": "Stores project-wide state, versioning, feature lists, and notes about current production build issues."
}